IdeaRS.OpenModel.Parameters.PositionRelatedTo
Position, to which is input related to.

IdeaRS.OpenModel.Parameters.PositionRelatedTo.Axis
Position is related to any axis.

IdeaRS.OpenModel.Parameters.PositionRelatedTo.TopOfSteel
Position is related to top of steel.

IdeaRS.OpenModel.Parameters.PositionRelatedTo.Profile
Position is related to the related profile (cross-section) bounding box.
In this case is Rows and Cols position are on the positive axes (top, right),
RowsNegative and ColsNegative are on the negative axes.

IdeaRS.OpenModel.Parameters.PositionRelatedTo.LeftSide
Position is related to the left side of main plate.

IdeaRS.OpenModel.Parameters.PositionRelatedTo.RightSide
Position is related to the right side of main plate.